[
    {
        "id": 0,
        "title": "Software Trainee",
        "company": "GammaTech Ltd",
        "dateRange": "June 2023 - May 2024",
        "responsibilities": [
            "Assisted with research, software development, testing, and automation.",
            "Provided technical support and handled multiple user inquiries daily.",
            "Performed SQL data querying, analysis, and report documentation."
        ]
    },
    {
        "id": 1,
        "title": "IT Support Engineer",
        "company": "Tropic Knits Group Ltd",
        "dateRange": "June 2024 - April 2025",
        "responsibilities": [
            "Managed and monitored security systems, Microsoft 365, and core IT infrastructure.",
            "Administered Active Directory, Group Policy, user accounts, and Linux systems.",
            "Oversaw networking, telephony (PABX), access points, and router configurations.",
            "Handled hardware repairs, user and device provisioning/deprovisioning, and provided on-site and remote support.",
            "Utilised ITSM and MDM tools to ensure efficient incident resolution and service delivery."
        ]
    },
    {
        "id": 2,
        "title": "Engineer I, IT Service Desk",
        "company": "Checkout.com",
        "dateRange": "May 2025 - Jul 2025",
        "responsibilities": [
            "Provided technical support for global teams across multiple regions and time zones.",
            "Automated repetitive support tasks using scripting and internal tools.",
            "Managed user lifecycle operations (provisioning, deprovisioning, permission adjustments) across multiple platforms (Okta, Google Workspace, Microsoft 365).",
            "Monitored and maintained ITSM workflows to ensure SLA compliance and improved service delivery.",
            "Contributed to process improvement and automation projects."
        ]
    },
    {
        "id": 3,
        "title": "Security Analyst I",
        "company": "Checkout.com",
        "dateRange": "Aug 2025 - Present",
        "promotionFrom": 2,
        "isCurrent": true,
        "responsibilities": [
            "Monitored global security events and alerts, triaging potential threats for the global team.",
            "Conducted security audits, access reviews, and policy compliance checks.",
            "Responded to and coordinated incident response activities, including investigation, containment, and remediation.",
            "Automated routine security operations tasks to improve response time and reduce manual workload.",
            "Documented incidents, audit findings, and response procedures to enhance security operations."
        ]
    }
]
